
# Debugging

Debugging is an art and just like art the more you practice, better you become. Just like art, tools and processes needed for debugging can be taught. But only practice will make you great at it. 

## Using the Python debugger

Python provides build-in debugger which can be called by importing module `pdb`. In this tutorial we are going to cover few most common actions which most developers perform as part of debugging the issue.

### Invoking the debugger

#### Through python interactive console

`pdb` can be invoked using the `import pdb`.

```python
import pdb

pdb.set_trace()
```

After `pdb.set_trace()` is executed then pdb waits for the user to provide a command to execute. 

#### Through command line

python also allows to call pdb through command line as shown below. 

```
$:> python -m pdb sample.py
```

In the above example, python will open the `sample.py` file for debugging. 

#### Through python interactive console

for Python < 3.7, we can use `pdb.set_trace()` as part of code and use it as shown in below example. 

```python
def sum(a, b):
    try:
        return a + b
    except Exception as e:
        print("!!! Error !!!", e)
        breakpoint()

a = "Aryan"
sum(10, a)
```


**Output:**
    
```python
python set_trace_sample.py
('!!! Error !!!', TypeError("unsupported operand type(s) for +: 'int' and 'str'",))
--Return--
> /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/set_trace_sample.py(9)sum()->None
-> set_trace()
(Pdb)
```

Python 3.7, provides a new way start the debugger (PEP-0553). New built-in function `breakpoint()` when added to the code at certain point will launch the `pdb` at that point as shown in the below example  

```python
def sum(a, b):
    try:
        return a + b
    except Exception as e:
        print("!!! Error !!!", e)
        breakpoint()
        
sum(10, a)
```

You can add either `breakpoint()` or `set_trace()` just before you wish to debug the code. 

### Debugger Commands

Once in `pdb` shell, we can provide following debugging commands to regulate the debugging process.  

#### `h(elp)`

On `pdb` shell when `h` or `help` is typed, pdb provide its built-in help similar to as shown below

```
Documented commands (type help <topic>):
========================================
EOF    bt         cont      enable  jump  pp       run      unt
a      c          continue  exit    l     q        s        until
alias  cl         d         h       list  quit     step     up
args   clear      debug     help    n     r        tbreak   w
b      commands   disable   ignore  next  restart  u        whatis
break  condition  down      j       p     return   unalias  where

Miscellaneous help topics:
==========================
exec  pdb

Undocumented commands:
======================
retval  rv

```


In the below section, we will try to cover few of the most common commands from the above list.

#### `q(uit)`

It allows to exit from `pdb` shell and it also exits out of the program under debugging. 

#### w(here)

It prints a stack trace along with the details. With most recent frame at the bottom indicated by an arrow as shown below

```
(Pdb) w
  /usr/lib64/python2.7/bdb.py(400)run()
-> exec cmd in globals, locals
  <string>(1)<module>()
  /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/sample_code.py(13)<module>()
-> multi_add(10, 2, 4)
> /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/sample_code.py(8)multi_add()
-> total = 0
```

We are currently on line with code `total = 0` (line number 8) in function `multi_add(10, 2, 4)` in file `sample_code.py`

#### `d(own)`

Move the current frame count (default one) levels down in the stack trace (to a newer frame).

#### `u(p)`

Move the current frame count (default one) levels up in the stack trace (to an older frame).

```python
def multi_add(*argv):
        total = 0
        for a in argv:
                total = total + a
        return total

multi_add(10, 2, 4)
```

#### `s(tep)`

It execute the current line and then stops at the first possible occasion. Debugging the above code using `s`.

```
$:> python -m pdb sample_code.py

> sample_code.py(4)<module>()
-> """
(Pdb) s
> sample_code.py(7)<module>()
-> def multi_add(*argv):
(Pdb) s
> sample_code.py(13)<module>()
-> multi_add(10, 2, 4)
(Pdb) s
--Call--
> sample_code.py(7)multi_add()
-> def multi_add(*argv):
(Pdb) s
> sample_code.py(8)multi_add()
-> total = 0
(Pdb) s
> sample_code.py(9)multi_add()
-> for a in argv:
(Pdb) s
> sample_code.py(10)multi_add()
-> total = total + a
(Pdb) s
> sample_code.py(9)multi_add()
-> for a in argv:
(Pdb) s
> sample_code.py(10)multi_add()
-> total = total + a
(Pdb) s
> sample_code.py(9)multi_add()
-> for a in argv:
(Pdb) s
> sample_code.py(10)multi_add()
-> total = total + a
(Pdb) s
> sample_code.py(9)multi_add()
-> for a in argv:
(Pdb) s
> sample_code.py(11)multi_add()
-> return total
(Pdb) s
--Return--
> sample_code.py(11)multi_add()->16
-> return total
(Pdb) s
--Return--
> sample_code.py(13)<module>()->None
-> multi_add(10, 2, 4)
(Pdb) s
--Return--
> <string>(1)<module>()->None
(Pdb) s
> /usr/lib64/python2.7/bdb.py(404)run()
-> self.quitting = 1
(Pdb) s
```

#### `n(ext)`

Continue the execution until the next line in the current function is reached or function returns to its parent function.
What that means is if say we have the following code

```python
a = func(x) + func(y) 
print(a)
```
then entire line (`a = func(x) + func(y)`) is processed and it stops at `print(a)`. 

```
$:> python -m pdb sample_code.py

> sample_code.py(4)<module>()
-> """
(Pdb) n
> sample_code.py(7)<module>()
-> def multi_add(*argv):
(Pdb) n
> sample_code.py(13)<module>()
-> multi_add(10, 2, 4)
(Pdb) n
--Return--
> sample_code.py(13)<module>()->None
-> multi_add(10, 2, 4)
(Pdb) n
--Return--
> <string>(1)<module>()->None
```

#### Difference between `step` and `next`

That `step` will step inside `func(x)` and will stops inside it function, while next executes called functions, only stopping at the next line in the current function which is `print(a)`

#### `continue  lineno`

- Without argument: execution will continue until the line with a number greater than the current one is reached.
- With line number: execution will continue until a line with a number greater or equal to the specified is reached. 

In both cases, also stop when the current frame returns

#### `r(eturn)`

The execution continues until the current function returns.

#### `c(ont(inue))`

The execution continues and it only stops when a breakpoint is encountered.

#### `b(reak)`

Creates a breakpoint using one of the following 
- **line number**: Sets the breakpoint at the given line

- **function argument**: Sets the breakpoint at the first line of the given function

It is also possible to set the non loaded file for both line number & function name breakpoint. In this case filename needs to be provided prior to line number and function name.

- **Line Number on another file:**
```
(Pdb) b utils.py: 2
Breakpoint 1 at /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/utils.py:2
(Pdb) r
> /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/utils.py(2)<module>()
-> def multi_add(*argv):
```

- **function on another file:** Creates a breakpoint on function `multi_add` function in file `utils.py`
```
(Pdb) b utils.multi_add
Breakpoint 1 at /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/utils.py:2
(Pdb)
```

#### `tbreak` 

Similar to `b(reak)`, except gets removed after first usage.

#### `cl(ear)`

clears all the break points if no arguments are present else only clears the requested breakpoint(s).

#### `disable`

Disables already set breakpoints. Multiple breakpoints can be provide as space separated list.  

#### `enable`

Enables the breakpoints (space separated list) specified

#### `ignore bpnumber [count]`

Instructs the debugger to ignore the breakpoint `count` number of times. Ig count is not present or is zero. then nothing happens. 

#### `condition bpnumber [condition]`

Updates or add a new condition for the existing breakpoint. If `condition` is absent, any existing condition is removed.

#### `q(uit)`

Quit from the debugger. The program being executed is aborted.

### Reading a value of a variable

We can use `p` pdb command to read the value of the already existing variable. It will not be able to provide you have to non existing variables as shown in the below example 

```python
> /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/utils.py(3)multi_add()
-> total = 1
(Pdb) p total
*** NameError: NameError("name 'total' is not defined",)
(Pdb) s
> /home/mayank/code/mj/python/lep/Section 1 - Core Python/Chapter 99 - Debugging/code/pdb/utils.py(4)multi_add()
-> for a in argv:
(Pdb) p total
1
```

### Reference:

- https://www.python.org/dev/peps/pep-0553/
